//
//  TermsModel.swift
//  여행의 시작 Boarding
//
//  Created by 서충원 on 2023/12/02.
//

import Foundation

struct Terms {
    static let ConditionsOfUse = """
    제 1조 (목적)

    ① 보딩 커뮤니티 서비스 이용 약관(이하 '약관')'은 보딩 회원(이하 '회원')이 보딩(이하 '회사')가 자사 앱서비스를 통해 제공하는 커뮤니티 서비스를 이용함에 있어 회사와 회원 간의 권리와 의무, 서비스 이용조건 및 절차 등 기본적인 사항을 명시하고 규정함을 목적으로 합니다.

    제 2조 (용어의 정의)

    ① ‘커뮤니티 서비스(이하 '서비스')'란 회사가 회원간 의사 소통, 의견 개진, 본인 저작물의 게시/저장/공유를 위해 제공하는 커뮤니티, 여행 기록, 플랜 등 앱서비스 내에서 제작되고 교류되는 서비스 일체를 말합니다.

    제 3조 (약관의 효력 및 개정)

    ① 이 약관은 보딩 회원 가입 시 또는 커뮤니티 서비스 이용를 개시하는 시점에 약관 동의를 선택함으로써 효력이 발생합니다.
    ② 회사는 서비스 개선 또는 회사 정책상의 중요 사유에 따라 서비스 항목을 추가, 삭제하거나 제공 방식을 변경할 때 관련법이 허용하는 범위 내에서 이 약관을 개정할 수 있습니다.
    ③ 약관을 변경할 경우 회사는 사전에 커뮤니티 서비스 초기 화면에 현행 약관과 개정 약관 내용을 함께 게시하고, 적용일자 및 변경 사유를 명시하여 공지합니다.
    ④ 회원은 변경 약관에 동의하지 않을 경우 이용 계약을 해지할 수 있습니다.

    제 4조 (약관 외 준칙)

    ① 서비스 이용과 관련하여 본 약관에 명시되지 않은 사항에 대해서는 ‘보딩 서비스 이용 약관'과 '개인정보보호정책'이 적용되며, 그 외 사항은 전기통신관계법 및 상관례에 따릅니다.

    제 5조 (서비스의 제공)

    ① 회사는 회원이 본 약관에 동의하는 즉시 서비스 제공을 개시합니다.
    ② 서비스 제공은 연중무휴를 원칙으로 하되 회사의 업무상, 기술상, 정책상 이유로 서비스를 일시 중단할 수 있으며 이 경우 사전에 공지합니다. 그러나 천재지변 또는 이에 준하는 긴급한 사유로 인해 서비스를 제공할 수 없는 경우에는 사후 공지합니다.
    ③ 회사가 통제할 수 없는 타인(기간통신사업자 등)의 고의, 과실로 인한 시스템 중단 등의 경우에는 통지하지 않습니다.

    제 6조 (광고의 게재 및 발신)

    ① 회사는 서비스의 제공을 위해 서비스 내부에 광고를 게재할 수 있습니다.
    ② 회사는 이용자의 이용기록을 활용한 광고를 게재할 수 있습니다.
    ③ 회사는 회원이 광고성 정보 수신에 동의할 경우, 서비스 내부 알림 수단과 회원의 연락처를 이용하여 광고성 정보를 발신할 수 있습니다.
    ④ 회사는 광고 게재 및 동의된 광고성 정보의 발신으로 인해 발생한 피해에 대해 어떠한 책임도 지지 않습니다.

    제 7조 (회원의 권리와 의무)

    ① 회원은 본 약관이 규정하는 사항과 관계법령을 준수하여야 하며, 회사의 업무를 방해하는 행위, 회사의 명예를 손상시키는 행위를 해서는 안됩니다.
    ② 회원은 자신의 운영 취지에 반하는 게시물에 대하여 게재를 거부하거나 삭제할 수 있습니다.
    ③ 회원의 개인정보 관리 소홀 또는 부정사용으로 인한 결과에 대한 책임은 회원에게 있습니다.
    ④ 회원은 회원 가입 시 기재한 정보에 변경 사항이 있을 경우 이를 직접 수정하여야 하며 개인정보 기재 오류로 인한 손해에 대하여 회사는 책임지지 않습니다.
    ⑤ 회원은 회사 및 타인의 지적 재산권을 침해할 수 없습니다.
    ⑥ 회원은 회사의 동의 없이 서비스를 이용하여 영업 행위를 할 수 없으며 규정을 위반한 영업 행위로 인해 회사나 다른 회원에게 손해가 발생할 경우 이에 대한 손해를 배상하여야 합니다.
    ⑦ 회원은 회사의 공지를 주기적으로 확인하여야 합니다.

    제 8조 (게시물의 저작권)

    ① 게시물의 저작권은 이를 작성한 회원에게 있으며 회사 또는 다른 회원은 저작권자 동의 없이 영리 추구를 위해 저작물을 사용할 수 없습니다.
    ② 서비스 운영과 관련하여 회사가 작성한 게시물의 저작권은 회사에 귀속되며 이용자는 회사의 동의 없이 이를 무단으로 사용할 수 없습니다.
    ③ 회사는 서비스 내 모든 게시물에 대한 게시권을 갖습니다. 다음의 경우 회사는 저작권자의 사전 동의 없이 게시물을 이용할 수 있으며 원본의 내용을 크게 해치지 않는 범위에서 수정, 재가공할 수 있습니다.
    회사가 제공하는 사이트 내에서의 컨텐츠 홍보를 수행하는 경우
    회사가 제휴 관계를 맺고 있는 사이트 내에서 서비스를 안내하거나 홍보하는 경우
    회사의 홍보 목적으로 미디어, 통신사 등에 컨텐츠를 제공하는 경우. 단, 이 경우 회사는 이용자 동의 없이 이용자 개인정보를 제공하지 않습니다.
    ④ 회사가 정한 절차에 따라 이용자가 동의 의사를 밝힌 경우 회사는 해당 이용자가 저작권을 소유한 저작물을 제 3자에게 제공할 수 있습니다.
    ⑤ 회원의 게시물이 타인의 저작권을 침해할 경우 회사는 이에 대한 민, 형사상의 책임을 지지 않습니다. 회원의 저작권 침해 행위로 인해 회사가 타인으로부터 이의 제기를 받는 경우 회원은 회사의 면책을 위해 노력하여야 하며, 회사가 면책되지 못하는 경우 회원은 그로 인한 회사의 손해를 부담하여야 합니다.

    제 9조 (게시물의 관리)

    ① 모든 게시물에 대한 책임은 게시한 자에게 있으며 게시물이 전달하는 정보의 신뢰도, 정확성 등에 대해서 회사는 책임지지 않습니다.
    ② 회원이 직접 삭제한 게시물에 대해서 회사는 이를 별도로 보관하거나 복구할 책임을 지지 않습니다.
    ③ 게시물이 아래 각 호에 해당할 경우 회사는 이를 삭제, 이동하거나 등록을 거부할 수 있고 서비스 내 표시 및 공람을 허용하지 않을 수 있습니다.
    공공질서와 미풍양속을 저해하는 내용
    폭력적이거나 저속하고 음란한 내용
    불법 복제, 해킹, 기타 현행법을 위반하거나 저촉할 우려가 있는 내용
    특정 개인이나 단체를 모욕하거나 명예를 훼손하고 피해를 줄 의도를 담고 있는 내용
    타인의 지적 재산권, 초상권 등 권리를 침해하는 내용
    광고, 홍보, 판촉 등 영리를 목적으로 한 상업적 내용사적인 정치적 판단이나 종교적 견해로 이용자간 위화감을 조장하는 내용
    서비스 각 영역이 규정하고 있는 운영 원칙에 어긋나거나 부합하지 않는 내용
    이해 당사자의 삭제 요청이 있거나 회사가 피소, 고발될 수 있는 근거를 제공하는 경우
    동일한 내용을 반복 게시하는 등 다른 이용자의 서비스 이용에 지장을 초래하는 경우
    회사의 원활한 서비스 제공을 방해하는 경우
    범죄와 결부된다고 객관적으로 인정되는 경우
    기타 관계법령에 위배된다고 판단되는 내용

    제 10조 (서비스 이용 권한과 책임)

    ① 아이디, 비밀번호 등 개인 정보에 대한 관리 책임은 회원에게 있으며, 서비스 이용 권한, 기타 이용 계약상 지위를 서비스가 규정하고 있는 절차를 수행하지 않은 채로 타인에게 양도, 증여하거나 담보로 제공할 수 없습니다.

    제 11조 (이용 제한)

    ① 회사는 본 약관 제9조 4항에서 규정하고 있는 지침을 위반한 회원에게 자발적인 위반 사항 해소를 요구할 수 있으며 회원이 이를 신속히 이행하지 않거나 반복적으로 위반할 경우 해당 회원의 이용 권한을 제한할 수 있습니다.
    ② 회원이 다음 각 호의 행위를 한 경우 회사는 서비스 이용 제한 등의 조치를 취할 수 있으며 같은 행위가 재발하는 경우 이용계약을 해지할 수 있습니다.
    가입 신청 시 허위 내용을 등록하는 행위
    타인의 서비스 이용을 방해하거나 명의, 정보를 도용하는 행위
    타인의 동의 없이 개인정보를 수집, 저장, 공개하는 행위
    회사 직원 혹은 관리자, 관계자를 사칭하는 행위
    회사 혹은 회원의 인격권 또는 지적재산권을 침해하는 행위
    회사의 동의 없이 클라이언트 프로그램을 변경하거나 회사의 서버를 해킹하는 행위
    사전 설명 없이 Active X, 스파이웨어, 애드웨어 등 이용자에게 불편을 주는 프로그램을 무조건 설치하도록 유도하는 행위
    회사의 사전 승낙 없이 영리를 목적으로 하는 광고 행위
    범죄와 관련 있다고 객관적으로 판단되는 행위
    기타 관계법령에 위배되는 행위

    제 12조 (자료의 보관)

    ① 회원이 서비스를 이용하며 축적한 데이터에 대한 보관 책임은 회원에게 있으며, 무료 서비스의 장애, 제공 중단, 자료 멸실, 삭제, 변조 등으로 인한 손해에 대해서 회사는 원상 복구에 최선을 다할 의무만을 지닙니다.
    ② 회원이 서비스 이용 계약을 해지하였을 경우, 관련하여 삭제된 자료는 복구할 수 없습니다. 단, 스크랩 기능 등을 통해 복제, 전송된 컨텐츠는 삭제 대상에 포함되지 않습니다. 이는 서비스 이용 계약 해지 이전 회원이 직접 삭제한 게시물에도 적용됩니다.
    ③ 회사가 본 약관 제 8조, 및 9조에 의거하여 게시물을 삭제하는 경우 삭제된 자료에 대해서 복구할 책임을 지지 않습니다.

    제 13조 (정보의 제공 및 통지)

    ① 회사는 서비스 이용에 필요한 각종 정보를 전자우편이나 서신우편 등의 방법으로 회원에게 제공할 수 있습니다.
    ② 회사는 서비스 개선을 위하여 회원의 동의 하에 추가적인 개인 정보를 수집하고 이를 보관할 수 있습니다.
    ③ 회원이 부정확한 전자우편 주소를 입력해 회사의 통지를 받아보지 못한 경우 회사는 이에 대한 책임을 지지 않습니다.
    ④ 회사가 불특정다수 회원에 대해 통지할 경우 1주일간 회사 게시판에 해당 내용을 게시함으로써 개별 통지에 갈음할 수 있습니다.

    제 14조 (면책 조항)

    ① 회사는 아래에서 규정하고 있는 경우에 대하여 민형사상 책임을 지지 않습니다.
    회원의 귀책 사유로 인한 서비스 이용 장애 및 자료 손실회원의 컴퓨터 오류, 부정확한 신상 정보, 전자우편 미 확인 등으로 인해 손해가 발생한 경우
    회원간 혹은 회원과 제3자간에 개인신상정보 무단 유출로 인해 손해가 발생한 경우
    회원간 혹은 회원과 제3자간에 획득한 자료로 인해 일방 혹은 양방에 손해가 발생한 경우
    ② 회사는 회원 상호간 혹은 회원과 제3자간에 서비스를 매개로 분쟁이 발생할 경우 이에 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 지지 않습니다.

    제 15조 (서비스 이용계약의 종료)

    ① 회원은 언제든지 서비스 내부의 탈퇴하기를 통해 탈퇴를 요청할 수 있습니다. 문의 창구를 통한 탈퇴요청은 처리되지 않습니다.
    ② 탈퇴처리가 완료되었더라도, 회원이 게시한 게시물은 삭제되지 않습니다.
    ③ 회사는 회원이 1년이상 로그인을 하지 않을 경우 회원의 동의 없이 회원자격을 박탈할 수 있습니다.
    ④ 회사는 천재지변, 테러, 폐교 등 이에 준하는 불가피한 사유로 더이상 서비스를 제공할 수 없을 경우 회원의 동의 없이 회원자격을 박탈할 수 있습니다.
    ⑤ 회사는 1학부터 전항까지로 인해 발생한 피해에 대해 어떠한 책임도 지지 않습니다.

    제 16조 (재판권 및 준거법)

    ① 회사와 회원 사이에 서비스와 관련하여 분쟁이 발생하는 경우 대한민국 민사소송법상 관할 법원에 소송을 제기할 수 있습니다.
    ② 전항의 경우 준거법은 대한민국법을 적용합니다.
    ③ 해당 약관에서 정하지 아니한 사항과 약관의 해석에 관해서는 관련법 또는 관례에 따릅니다.
    """
    
    static let privacyPolicy = """
    제 1조 (개인정보의 처리 목적)

    ① ‘Boarding’ (이하 ‘’보딩’)는 다음의 목적을 위하여 개인정보를 처리하고 있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.
    고객 가입의사 확인
    고객에 대한 서비스 제공에 따른 본인 식별.인증
    회원자격 유지.관리, 물품 또는 서비스 공급에 따른 금액 결제
    물품 또는 서비스의 공급. 배송 등

    제 2조 (개인정보의 처리 및 보유 기간)

    ① 보딩은 정보주체로부터 개인정보를 수집할 때 동의 받은 개인정보 보유․이용기간 또는 법령에 따른 개인정보 보유․이용기간 내에서 개인정보를 처리․보유합니다.
    ② 구체적인 개인정보 처리 및 보유 기간은 다음과 같습니다.
    고객 가입 및 관리 : 서비스 이용계약 또는 회원가입 해지시까지, 다만 채권․채무관계 잔존시에는 해당 채권․채무관계 정산시까지
    전자상거래에서의 계약․청약철회, 대금결제, 재화 등 공급기록 : 5년

    제 3조 (개인정보의 제3자 제공에 관한 사항)

    ① 보딩은 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.
    ② 보딩은 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.
    **개인정보 제 3자 제공
    개인정보를 제공받는 자 : Google ads, Google Firebase
    제공받는 자의 개인정보 이용목적 : 맞춤형 광고 제공 및 회원정보 저장 및 관리

    제 4조 (개인정보처리 위탁)

    ① 보딩은 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
    **개인정보처리 위탁
    위탁받는 자 (수탁자) : Google Firebase
    위탁하는 업무의 내용 : 회원정보 저장 및 관리
    ② 보딩은 위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적․관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리․감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.
    ③ 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.

    제 5조 (정보주체와 법정대리인의 권리·의무 및 그 행사방법)
    ① 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.
    ② 정보주체는 보딩에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
    개인정보 열람요구
    오류 등이 있을 경우 정정 요구
    삭제요구
    처리정지 요구

    제 6조 (처리하는 개인정보의 항목 작성)

    ① 보딩은 다음의 개인정보 항목을 처리하고 있습니다.
    **서비스 이용
    필수항목 : 이메일, 성별, 생년월일, 이름, 학력, 서비스 이용 기록, 접속 로그
    선택항목 : 없음

    제 7조 (개인정보의 파기)

    ① 보딩은 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.
    **파기절차
    이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.
    **파기기한
    이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.

    제 8조 (개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항)

    ① 보딩은 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠기(cookie)’를 사용합니다.
    ② 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다.
    ③ 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다.
    ④ 쿠키의 설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다.
    ⑤ 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.

    제 9조 (개인정보 보호책임자 작성)

    ① 보딩은 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
    **개인정보 보호책임자
    성명 : 김준호
    직책 : 대표
    직급 : 대표
    연락처 : official.boarding@gmail.com
    **개인정보 보호 담당부서
    담당자 : 김준호
    연락처 : official.boarding@gmail.com
    ② 정보주체께서는 보딩의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 보딩은 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.

    제 10조 (개인정보 처리방침 변경)

    ① 이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.

    제 11조 (개인정보의 안전성 확보 조치)

    ① 보딩은 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적 / 관리적 및 물리적 조치를 하고 있습니다.
    ② 정기적인 자체 감사 실시
    개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.
    ③ 개인정보의 암호화
    이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.
    ④ 개인정보에 대한 접근 제한
    개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
    """
    
    static let communityRule = """
    제 1조 (커뮤니티 이용규칙)

    ① 보딩의 커뮤니티는 사용자가 직접 만들어가는 공간입니다.

    ② 보딩을 이용하기 전, 이용약관을 꼼꼼히 숙지해주시기 바랍니다.

    ③ 보딩은 사용자들의 자유로운 사용을 지향합니다. 깨끗한 커뮤니티를 위해 노력해주시기 바랍니다.

    제 2조 (금지 행위 및 게시물)

    ① 욕설, 비아냥, 비속어 등 예의범절에 벗어난 게시물의 공유 및 작성

    ② 혐오스럽거나 타 사용자를 놀라게 하는 게시물의 공유 및 작성

    ③ 성적 비하, 각종 차별발언 등 불쾌감을 유발하는 게시물의 공유 및 작성

    ④ 특정인이나 단체/지역 등을 비방하는 게시물의 공유 및 작성

    ⑤ 중복, 도배, 내용없는 게시물의 공유 및 작성

    ⑥ 타인의 권리를 침해하는(초상권, 저작권 등) 게시물의 공유 및 작성

    ⑦ 허가되지 않은 광고/홍보물 또는 상업적 게시물의 공유 및 작성 (타 서비스 및 사이트 등의 홍보 등)

    ⑧ 정치적 홍보, 분란, 논란을 일으키는 게시물의 공유 및 작성

    ⑨ 외설 또는 음란물, 음담패설 등 성희롱과 관련된 게시물의 공유 및 작성

    ⑩ 관리자를 사칭하는 게시물의 공유 및 작성

    ⑪ 신고 시스템 악용 행위 및 무고한 신고행위

    ⑫ 현행 법에 저촉되거나, 현행 법상 불법으로 분류될 수 있는 모든 행위 및 게시물의 공유 및 작성

    ⑬ 기타 위 목록의 행위와 동일하거나, 비슷한 목적을 달성하기 위한 행위 일체

    위 내용은 보딩 서비스 내에서 사용자가 작성할 수 있는 모든 게시물(여행경험 글쓰기, 커뮤니티 등)에 적용됩니다.

    제 3조 (신고 제도)

    ① 서비스 이용규칙에 어긋난다고 생각하는 게시물은 신고 버튼을 이용하여 신고해주시기 바랍니다.

    ② 서비 이용규칙에 어긋나거나, 타 사용자들에게 신고를 받을 수 있는 게시물 작성으로 인한 신고로 발생한 피해는 어떠한 경우에도 책임을 지지 않습니다.

    ③ 모든 신고는 자동신고시스템을 통해 자동으로 처리됩니다. 임의의 판단 및 요청에 따라 게시물을 삭제하지 않습니다.

    ④ 신고가 누적된 사용자는 쪽지 제한, 게시글 작성 제한, 차단 등의 제제가 가해질 수 있으며 작성한 게시물은 즉시 삭제될 수 있습니다. 또한 정도에 따라 각 기능별 제한 이외에 서비스 전체 이용 제한 제제가 가해질 수 있습니다.

    ⑤ 정보통신망법에 반하는 홍보행위, 청소년유해매체물 게시, 이에 준하는 각종 불법행위가 이루어질 시 그 즉시 서비스 이용이 제한되며, 관련된 게시물은 모두 삭제됩니다.

    ⑥ 신고 제도를 악용할 경우, 해당 신고는 처리되지 않습니다. 신고 제도를 악용한 사용자는 제재가 가해질 수 있습니다.

    ⑦ 신고시, 관련 내용에 대한 판단과 제제를 위해 해당 게시물의 일부가 관리자에게 전송되거나, 관리자가 열람할 수 있습니다.

    제 4조 (허위사실 유포 및 명예훼손 게시물에 대한 게시 중단 요청)

    ① 게시물 강제 삭제에 관련한 모든 내용은 신고 시스템을 통해 이루어지므로, 신고하기 기능을 통해 해당 사실을 알려주시기 바랍니다.

    ② 보딩의 게시물을 통해 저작권 침해, 명예훼손 및 기타 권리를 침해받았다고 판단되실 경우, 신고하기를 통해 관리자에게 게시 중단을 요청하시길 권고드리며, 이후 담당자의 확인을 통해 게시중단, 게시자에 대한 제제 등 조치가 이루어질 것입니다.

    ③ 게시 중단 요청은 담당자를 통해 접수된 순서에 따라 처리됩니다.

    ④ 허위사실 유포 및 명예훼손에 해당하지 않는다고 판단할 수 없을 경우, 해당 게시물을 게시 중단 처리하지 않습니다.

    제 5조 (서비스 내부 모임 이용 규칙)

    ① 인증 후 사용할 수 있는 게시판 및 모임의 게시물 일체를 내용 복사, 스크린 샷 등을 통해 절대로 외부로 유출해서는 안 됩니다. 서비스 내 작성된 컨텐츠 유출로 인한 모든 피해에 대한 민형사상 책임과 손해배상의 의무는 해당 내용을 유포한 유출자에게 있습니다.

    ② 게시글 및 커뮤니티에서 귀책사유로 문제가 발생할 경우, 해당 사용자에게 모든 책임이 있습니다.

    위 내용은 보딩 서비스 내에서 사용자가 작성할 수 있는 모든 게시물(여행경험 글쓰기, 커뮤니티 등)에 적용되며, 게시물 이외에 사용자가 제작할 수 있는 항목 또한 적용됩니다.
    """
}
